In [ ]:
#-----> NESTED FUNCTIONS IN SQL <-------

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector as g
from tabulate import tabulate
import pandas as pd
mydb = g.connect (host = 'localhost',user = 'root',passwd = 'Loveumom@123')
cursor = mydb.cursor()

In [3]:
cursor.execute('SHOW DATABASES')
print(tabulate(cursor.fetchall(),headers = ['DATABASES'],tablefmt = 'pretty'))

+--------------------+
|     DATABASES      |
+--------------------+
|     cardataset     |
| information_schema |
|       mysql        |
| performance_schema |
|      sidfirst      |
|    sqlpractice1    |
|        sys         |
+--------------------+

In [4]:
cursor.execute('USE sidfirst')
cursor.execute('SHOW TABLES')
print(tabulate(cursor.fetchall(),headers = ['TABLES IN sidfirst'],tablefmt = 'pretty'))

+--------------------+
| TABLES IN sidfirst |
+--------------------+
|      customer      |
|      employee      |
|     glassdata      |
|   healthcaredata   |
|      ineuron       |
|      mysales       |
|       orders       |
|       sales        |
|        sid1        |
|      workers       |
+--------------------+

In [14]:
# Example : supoose we want to count the length of upper cased string "sql fundamentals"
cursor.execute("SELECT LENGTH(UPPER('sql fundamentals'))")

In [15]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+-----------------------------------+
| LENGTH(UPPER('sql fundamentals')) |
+-----------------------------------+
|                16                 |
+-----------------------------------+

In [11]:
# Example : suppose we want to calculate length of string after concatination of two small strings 'siddhant' and 'patel'
#           and check if the length is greater than 10 or not. if yes display too long otherwise under 10.

In [7]:
cursor.execute("""
SELECT CASE
           WHEN LENGTH (CONCAT ('Siddhant','Patel')) > 10 THEN 'Too Long'
           ELSE 'L is under 10'
        END AS Length_of_FullName ;
""")

In [23]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------------------+
| Length_of_FullName |
+--------------------+
|      Too Long      |
+--------------------+

In [24]:
cursor.execute("""
SELECT DAYNAME(DATE_FORMAT(CURDATE(), '%Y-%m-01')) AS first_day_of_month;
""")

In [25]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------------------+
| first_day_of_month |
+--------------------+
|      Thursday      |
+--------------------+

In [5]:
cursor.execute("""
CREATE TABLE sidfirst.employee (
    employee_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department_id INT,
    manager_id INT,
    salary DECIMAL(10, 2),
    product_id INT,
    price DECIMAL(10, 2),
    user_id INT,
    login_date DATE,
    activity_date DATE,
    activity_type VARCHAR(50),
    email VARCHAR(100)
);

""")

In [33]:
cursor.execute("USE sidfirst")
cursor.execute("SHOW TABLES")

In [34]:
cursor.fetchall()

[('customer',),
 ('employee',),
 ('glassdata',),
 ('healthcaredata',),
 ('ineuron',),
 ('mysales',),
 ('orders',),
 ('sales',),
 ('sid1',),
 ('workers',)]

In [14]:
cursor.execute("""
INSERT INTO sidfirst.employee (employee_id, first_name, last_name, department_id, manager_id, salary, product_id, price, user_id, login_date, activity_date, activity_type, email)
VALUES
(1, 'John', 'Doe', 1, NULL, 120000.00, 101, 50.00, 1001, '2024-01-01', '2024-01-01', 'login', 'john.doe@example.com'),
(2, 'Jane', 'Smith', 1, 1, 90000.00, 102, 75.00, 1002, '2024-01-02', '2024-01-02', 'login', 'jane.smith@example.com'),
(3, 'Jim', 'Beam', 2, NULL, 150000.00, 103, 200.00, 1003, '2024-01-03', '2024-01-03', 'login', 'jim.beam@example.com'),
(4, 'Jack', 'Daniels', 2, 3, 110000.00, 104, 150.00, 1001, '2024-01-04', '2024-01-04', 'login', 'jack.daniels@example.com'),
(5, 'Jessica', 'Jones', 2, 3, 105000.00, 105, 175.00, 1002, '2024-01-05', '2024-01-05', 'login', 'jessica.jones@example.com'),
(6, 'Jake', 'Johnson', 1, 1, 85000.00, 106, 90.00, 1003, '2024-01-06', '2024-01-06', 'login', 'jake.johnson@example.com'),
(7, 'Joan', 'Holloway', 3, NULL, 95000.00, 107, 120.00, 1001, '2024-01-07', '2024-01-07', 'login', 'joan.holloway@example.com'),
(8, 'John', 'Appleseed', 3, 7, 80000.00, 108, 110.00, 1002, '2024-01-08', '2024-01-08', 'login', 'john.appleseed@example.com'),
(9, 'Jamie', 'Lannister', 3, 7, 88000.00, 109, 60.00, 1003, '2024-01-09', '2024-01-09', 'login', 'jamie.lannister@example.com'),
(10, 'Jenna', 'Maroney', 1, 1, 95000.00, 110, 85.00, 1001, '2024-01-10', '2024-01-10', 'login', 'jenna.maroney@example.com'),
(11, 'Arya', 'Stark', 1, 1, 75000.00, 111, 180.00, 1002, '2024-01-11', '2024-01-11', 'login', 'arya.stark@example.com'),
(12, 'Ned', 'Stark', 1, NULL, 115000.00, 112, 240.00, 1003, '2024-01-12', '2024-01-12', 'login', 'ned.stark@example.com'),
(13, 'Sansa', 'Stark', 1, 12, 100000.00, 113, 160.00, 1001, '2024-01-13', '2024-01-13', 'login', 'sansa.stark@example.com'),
(14, 'Robert', 'Baratheon', 2, NULL, 145000.00, 114, 300.00, 1002, '2024-01-14', '2024-01-14', 'login', 'robert.baratheon@example.com'),
(15, 'Stannis', 'Baratheon', 2, 14, 95000.00, 115, 170.00, 1003, '2024-01-15', '2024-01-15', 'login', 'stannis.baratheon@example.com'),
(16, 'Renly', 'Baratheon', 2, 14, 85000.00, 116, 190.00, 1001, '2024-01-16', '2024-01-16', 'login', 'renly.baratheon@example.com'),
(17, 'Tywin', 'Lannister', 3, NULL, 155000.00, 117, 400.00, 1002, '2024-01-17', '2024-01-17', 'login', 'tywin.lannister@example.com'),
(18, 'Tyrion', 'Lannister', 3, 17, 120000.00, 118, 220.00, 1003, '2024-01-18', '2024-01-18', 'login', 'tyrion.lannister@example.com'),
(19, 'Cersei', 'Lannister', 3, 17, 130000.00, 119, 210.00, 1001, '2024-01-19', '2024-01-19', 'login', 'cersei.lannister@example.com'),
(20, 'Bran', 'Stark', 1, 12, 60000.00, 120, 70.00, 1002, '2024-01-20', '2024-01-20', 'login', 'bran.stark@example.com')
""")

In [15]:
mydb.commit()

In [22]:
cursor.execute("""
SELECT * FROM sidfirst.employee
""")

In [28]:
pd.read_sql('select * from sidfirst.employee',mydb)

C:\Users\admin\AppData\Local\Temp\ipykernel_2892\4172192709.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from sidfirst.employee',mydb)

,employee_id,first_name,last_name,department_id,manager_id,salary,product_id,price,user_id,login_date,activity_date,activity_type,email
0,1,John,Doe,1,NaN,120000.0,101,50.0,1001,2024-01-01,2024-01-01,login,john.doe@example.com
1,2,Jane,Smith,1,1.0,90000.0,102,75.0,1002,2024-01-02,2024-01-02,login,jane.smith@example.com
2,3,Jim,Beam,2,NaN,150000.0,103,200.0,1003,2024-01-03,2024-01-03,login,jim.beam@example.com
3,4,Jack,Daniels,2,3.0,110000.0,104,150.0,1001,2024-01-04,2024-01-04,login,jack.daniels@example.com
4,5,Jessica,Jones,2,3.0,105000.0,105,175.0,1002,2024-01-05,2024-01-05,login,jessica.jones@example.com
5,6,Jake,Johnson,1,1.0,85000.0,106,90.0,1003,2024-01-06,2024-01-06,login,jake.johnson@example.com
6,7,Joan,Holloway,3,NaN,95000.0,107,120.0,1001,2024-01-07,2024-01-07,login,joan.holloway@example.com
7,8,John,Appleseed,3,7.0,80000.0,108,110.0,1002,2024-01-08,2024-01-08,login,john.appleseed@example.com
8,9,Jamie,Lannister,3,7.0,88000.0,109,60.0,1003,2024-01-09,2024-01-09,login,jamie.lannister@example.com
9,10,Jenna,Maroney,1,1.0,95000.0,110,85.0,1001,2024-01-10,2024-01-10,login,jenna.maroney@example.com
10,11,Arya,Stark,1,1.0,75000.0,111,180.0,1002,2024-01-11,2024-01-11,login,arya.stark@example.com
11,12,Ned,Stark,1,NaN,115000.0,112,240.0,1003,2024-01-12,2024-01-12,login,ned.stark@example.com
12,13,Sansa,Stark,1,12.0,100000.0,113,160.0,1001,2024-01-13,2024-01-13,login,sansa.stark@example.com
13,14,Robert,Baratheon,2,NaN,145000.0,114,300.0,1002,2024-01-14,2024-01-14,login,robert.baratheon@example.com
14,15,Stannis,Baratheon,2,14.0,95000.0,115,170.0,1003,2024-01-15,2024-01-15,login,stannis.baratheon@example.com
15,16,Renly,Baratheon,2,14.0,85000.0,116,190.0,1001,2024-01-16,2024-01-16,login,renly.baratheon@example.com
16,17,Tywin,Lannister,3,NaN,155000.0,117,400.0,1002,2024-01-17,2024-01-17,login,tywin.lannister@example.com
17,18,Tyrion,Lannister,3,17.0,120000.0,118,220.0,1003,2024-01-18,2024-01-18,login,tyrion.lannister@example.com
18,19,Cersei,Lannister,3,17.0,130000.0,119,210.0,1001,2024-01-19,2024-01-19,login,cersei.lannister@example.com
19,20,Bran,Stark,1,12.0,60000.0,120,70.0,1002,2024-01-20,2024-01-20,login,bran.stark@example.com
20,1,John,Doe,1,NaN,120000.0,101,50.0,1001,2024-01-01,2024-01-01,login,john.doe@example.com
21,2,Jane,Smith,1,1.0,90000.0,102,75.0,1002,2024-01-02,2024-01-02,login,jane.smith@example.com
22,3,Jim,Beam,2,NaN,150000.0,103,200.0,1003,2024-01-03,2024-01-03,login,jim.beam@example.com
23,4,Jack,Daniels,2,3.0,110000.0,104,150.0,1001,2024-01-04,2024-01-04,login,jack.daniels@example.com
24,5,Jessica,Jones,2,3.0,105000.0,105,175.0,1002,2024-01-05,2024-01-05,login,jessica.jones@example.com
25,6,Jake,Johnson,1,1.0,85000.0,106,90.0,1003,2024-01-06,2024-01-06,login,jake.johnson@example.com
26,7,Joan,Holloway,3,NaN,95000.0,107,120.0,1001,2024-01-07,2024-01-07,login,joan.holloway@example.com
27,8,John,Appleseed,3,7.0,80000.0,108,110.0,1002,2024-01-08,2024-01-08,login,john.appleseed@example.com
28,9,Jamie,Lannister,3,7.0,88000.0,109,60.0,1003,2024-01-09,2024-01-09,login,jamie.lannister@example.com
29,10,Jenna,Maroney,1,1.0,95000.0,110,85.0,1001,2024-01-10,2024-01-10,login,jenna.maroney@example.com
30,11,Arya,Stark,1,1.0,75000.0,111,180.0,1002,2024-01-11,2024-01-11,login,arya.stark@example.com
31,12,Ned,Stark,1,NaN,115000.0,112,240.0,1003,2024-01-12,2024-01-12,login,ned.stark@example.com
32,13,Sansa,Stark,1,12.0,100000.0,113,160.0,1001,2024-01-13,2024-01-13,login,sansa.stark@example.com
33,14,Robert,Baratheon,2,NaN,145000.0,114,300.0,1002,2024-01-14,2024-01-14,login,robert.baratheon@example.com
34,15,Stannis,Baratheon,2,14.0,95000.0,115,170.0,1003,2024-01-15,2024-01-15,login,stannis.baratheon@example.com
35,16,Renly,Baratheon,2,14.0,85000.0,116,190.0,1001,2024-01-16,2024-01-16,login,renly.baratheon@example.com
36,17,Tywin,Lannister,3,NaN,155000.0,117,400.0,1002,2024-01-17,2024-01-17,login,tywin.lannister@example.com
37,18,Tyrion,Lannister,3,17.0,120000.0,118,220.0,1003,2024-01-18,2024-01-18,login,tyrion.lannister@example.com
38,19,Cersei,Lannister,3,17.0,130000.0,119,210.0,1001,2024-01-19,2024-01-19,login,cersei.lannister@example.com
39,20,Bran,Stark,1,12.0,60000.0,120,70.0,1002,2024-01-20,2024-01-20,login,bran.stark@example.com

In [32]:
# Problem : 1 -- AMAZON
# Write a query to find the second highest salary among the employees. 
# If there is no second highest salary, the query should return NULL.

# solution : 1
cursor.execute("""
SELECT MAX(salary) AS second_highest_salary
FROM sidfirst.employee
WHERE salary < (SELECT MAX(salary) FROM sidfirst.employee);
""")

In [33]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+-----------------------+
| second_highest_salary |
+-----------------------+
|       150000.00       |
+-----------------------+

In [4]:
# problem :2 --- GOOGLE
# You have a table Employee with the following structure: Employee (employee_id, department_id, salary)
# Write a query to find the department with the highest average salary.

# Solution : 2
cursor.execute("""
SELECT department_id
FROM sidfirst.employee
GROUP BY department_id
ORDER BY AVG(salary) DESC
LIMIT 1;
""")

In [5]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------------+
| department_id |
+---------------+
|       2       |
+---------------+

In [6]:
# problem : 3 --- MICROSOFT
# find total number of employees earning a salary above avg salary

# solution : 3

cursor.execute("""
SELECT COUNT(*)
FROM sidfirst.employee
WHERE salary > (SELECT AVG(salary) FROM sidfirst.employee)
""")

In [7]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+----------+
| COUNT(*) |
+----------+
|    18    |
+----------+

In [12]:
# problem : 4 -- APPLE
# Given a table Employee with the following structure: Employee (employee_id, salary)
# Write a query to find the top 3 highest distinct salaries.

# solution : 4

cursor.execute("""
SELECT DISTINCT salary
FROM sidfirst.employee
ORDER BY salary DESC
LIMIT 3
""")

In [13]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+-----------+
|  salary   |
+-----------+
| 155000.00 |
| 150000.00 |
| 145000.00 |
+-----------+

In [14]:
# problem :5 -- GOOGLE
# You have a table employee with the following structure: (user_id, email)
# Write a query to find all duplicate email addresses in the table.

# solution : 5
cursor.execute("""
SELECT email
FROM sidfirst.employee
GROUP BY email
HAVING COUNT(email) > 1 ;
""")

# Explaination
# The GROUP BY groups the rows by email.
# The HAVING COUNT(email) > 1 filters out emails that appear more than once,means duplicates.

In [15]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+-------------------------------+
|             email             |
+-------------------------------+
|     john.doe@example.com      |
|    jane.smith@example.com     |
|     jim.beam@example.com      |
|   jack.daniels@example.com    |
|   jessica.jones@example.com   |
|   jake.johnson@example.com    |
|   joan.holloway@example.com   |
|  john.appleseed@example.com   |
|  jamie.lannister@example.com  |
|   jenna.maroney@example.com   |
|    arya.stark@example.com     |
|     ned.stark@example.com     |
|    sansa.stark@example.com    |
| robert.baratheon@example.com  |
| stannis.baratheon@example.com |
|  renly.baratheon@example.com  |
|  tywin.lannister@example.com  |
| tyrion.lannister@example.com  |
| cersei.lannister@example.com  |
|    bran.stark@example.com     |
+-------------------------------+

In [22]:
# creating 2 tables customer and orders to use then in problem : 6 
cursor.execute("""
CREATE TABLE sidfirst.customer(customer_id INT PRIMARY KEY,name VARCHAR(100));
""")

In [23]:
cursor.execute("""
INSERT INTO sidfirst.customer (customer_id,name) VALUES
(1,'tara'),
(2,'diya'),
(3,'sara'),
(4,'kaya'),
(5,'dhara'),
(6,'raha'),
(7,'maya'),
(8,'riya'),
(9,'kiara'),
(10,'jiya')
""")

In [24]:
mydb.commit()

In [30]:
cursor.execute("""
CREATE TABLE sidfirst.orders(
order_id INT PRIMARY KEY,
customer_id INT,
FOREIGN KEY (customer_id) REFERENCES sidfirst.customer(customer_id));
""")

In [31]:
mydb.commit()

In [35]:
cursor.execute("""
INSERT INTO sidfirst.orders (order_id,customer_id) VALUES
(101, 1),
(102, 2),
(103, 3),
(104, 4),
(105, 3),
(106, 8),
(107, 5),
(108, 6),
(109, 3),
(110, 10);
""")  # here customer_id 3 is repeating 3 times so sara ordered 3 times.

In [36]:
mydb.commit()

In [37]:
# problem : 6 -- FACEBOOK
# Given two tables Customer and Orders with the following structures:
# Customer (customer_id, name) # Orders (order_id, customer_id)
# write a query to find a customer with most orders

# SOLUTION : 6
cursor.execute ("""
SELECT name
FROM sidfirst.customer
WHERE customer_id = (
    SELECT customer_id
    FROM sidfirst.orders
    GROUP BY customer_id
    ORDER BY COUNT(*) DESC
    LIMIT 1
);
""")

In [38]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+------+
| name |
+------+
| sara |
+------+

In [5]:
# problem : 7 Netflix
# You have a table with the following structure: (user_id,login_date)
# Write a query to find the user with the longest continuous sequence of daily logins.

# solution : 7 involved window functions

In [ ]:
# prblm : 8 twitter - median salary
# You have a table Employee with the following structure: (employee_id,salary)
# write a query to find median salary

In [12]:
# problem : 9 Tesla: Products with Price Greater Than All Other Products
# Given a table Products with the following structure: Products (product_id, price)
# Write a query to find the products with a price greater than all other products.

# solution :
cursor.execute("""
SELECT product_id
FROM sidfirst.employee p1
WHERE price > ALL (
    SELECT price 
    FROM sidfirst.employee p2 
    WHERE p2.product_id <> p1.product_id);
""")

In [ ]:
"""
Explaination:
The SELECT employee_id FROM sidfirst.employee e1 part selects the employee_id from the sidfirst.employee table, aliasing it as e1.
The WHERE salary > ALL (...) condition checks whether the salary of the current employee_id in e1 is greater than the salaries of all other employees in the subquery.
The subquery SELECT salary FROM sidfirst.employee e2 WHERE e2.employee_id <> e1.employee_id retrieves the salaries of all employees except the current one.
"""

In [13]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+------------+
| product_id |
+------------+
|    117     |
|    117     |
+------------+

In [7]:
# solution of prblm 9 with different approach
cursor.execute("""
SELECT product_id FROM sidfirst.employee WHERE price = (SELECT MAX(price) FROM sidfirst.employee);
""")

In [8]:
print(tabulate(cursor.fetchall(),headers=[column[0] for column in cursor.description],tablefmt = 'pretty'))

+------------+
| product_id |
+------------+
|    117     |
|    117     |
+------------+